[
  {
    "id": 0,
    "header": "Intro to Digital Content",
    "type": "Combined",
    "length": "Self Paced",
    "body": "This online, self-paced course gives trainees a basic understanding of JavaScript, HTML & CSS, unit tests, and guides them to building their first simple website. Completion of this course is required to access the full course."
  },

  {
    "id": 1,
    "header": "Fundamentals",
    "type": "Combined",
    "length": "3 Weeks",
    "body": "This module is a three week immersion into the core principles of digital product development. Trainees work through the key stages of development: Requirements, Iteration, and Delivery. Trainees work in teams to discover requirements and express them as user stories. Trainees iterate on their work and then ship their websites to production"
  },

  {
    "id": 2,
    "header": "Induction and Git",
    "type": "Personal Development",
    "length": "1 Week",
    "body": "This week inducts trainees to the Software Development Course and then introduces trainees to Git and Github using Github Desktop. This is a key skill for all developers and is also how we do our coursework at CodeYourFuture."
  },

  {
    "id": 3,
    "header": "HTML and CSS",
    "type": "Tech",
    "length": "4 Weeks",
    "body": "Introducing Front End. What is frontend? It's another word for the presentational part of a piece of software. In terms of web development we're talking about 'what you see' when you go to any website. Think of it like this: if a webpage were a person, the HTML would be the skeleton and CSS the skin and clothing!"
  },

  {
    "id": 4,
    "header": "JavaScript",
    "type": "Tech",
    "length": "4 Weeks",
    "body": "In this module you'll make a start into the wonderful world of programming. We will be using the programming language JavaScript to do so. You'll learn about the basic building blocks of programming: loops, functions, control flow and more. Consider these as the ABC's of programming, without them it's impossible to write working software!"
  }
]
